<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>7. VLAN</title><link rel="stylesheet" href="/docbook.css" type="text/css" /><meta name="generator" content="DocBook XSL Stylesheets V1.75.2" /><meta name="keywords" content="pix,asa,3750,4507,5550, vlan,vtp, hsrp,vrrp, rip,ospf" /><link rel="home" href="index.html" title="Netkiller Cisco IOS 手札" /><link rel="up" href="switch.html" title="第 5 章 Switch" /><link rel="prev" href="switch.channel-group.html" title="6. Ethernet Port Groups" /><link rel="next" href="switch.speed.html" title="8. 流量控制" /><script xmlns="" type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-11694057-1']);
  _gaq.push(['_setDomainName', 'netkiller.sourceforge.net']);
  _gaq.push(['_setAllowHash', 'false']);
  _gaq.push(['_setAllowLinker', true]);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">7. VLAN</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="switch.channel-group.html">上一页</a> </td><th width="60%" align="center">第 5 章 Switch</th><td width="20%" align="right"> <a accesskey="n" href="switch.speed.html">下一页</a></td></tr></table><hr /></div><table xmlns="" width="100%" border="0"><tr><td align="left"><a href="http://netkiller.sourceforge.net/">Home</a> |
                <a href="http://netkiller.github.com/">Mirror</a> |
                <a href="/search.html">Search</a></td><td align="right"><form id="searchbox_008589143145807374698:f5uprauilyy" action="/search.html"><input type="hidden" name="cx" value="008589143145807374698:f5uprauilyy" /><input type="hidden" name="cof" value="FORID:11" /><input name="q" type="text" size="25" style="border-top-width: 1px; border-right-width: 1px; border-bottom-width: 1px; border-left-width: 1px; border-top-style: solid; border-right-style: solid; border-bottom-style: solid; border-left-style: solid; border-top-color: rgb(126, 157, 185); border-right-color: rgb(126, 157, 185); border-bottom-color: rgb(126, 157, 185); border-left-color: rgb(126, 157, 185); padding-top: 2px; padding-right: 2px; padding-bottom: 2px; padding-left: 2px; background-image: url(http://www.google.com/cse/intl/en/images/google_custom_search_watermark.gif); background-attachment: initial; background-origin: initial; background-clip: initial; background-color: rgb(255, 255, 255); background-position: 0% 50%; background-repeat: no-repeat no-repeat; " /><input type="submit" name="sa" value="Search" /><input name="siteurl" type="hidden" value="http://netkiller.sourceforge.net/" /></form><script type="text/javascript" src="http://www.google.com/coop/cse/brand?form=searchbox_008589143145807374698%3Af5uprauilyy"></script></td></tr></table><div class="section" title="7. VLAN"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="switch.vlan"></a>7. VLAN</h2></div></div></div>
		
		<div class="section" title="7.1. vlan database"><div class="titlepage"><div><div><h3 class="title"><a id="idp357952"></a>7.1. vlan database</h3></div></div></div>
			
		<pre class="screen">
		
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#
*Mar  1 00:29:54.407: %SYS-5-CONFIG_I: Configured from console by console
Switch(vlan)#show
  VLAN ISL Id: 1
    Name: default
    Media Type: Ethernet
    VLAN 802.10 Id: 100001
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 2
    Name: server
    Media Type: Ethernet
    VLAN 802.10 Id: 100002
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 3
    Name: office
    Media Type: Ethernet
    VLAN 802.10 Id: 100003
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1002
    Name: fddi-default
    Media Type: FDDI
    VLAN 802.10 Id: 101002
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1003
    Name: token-ring-default
    Media Type: Token Ring
    VLAN 802.10 Id: 101003
    State: Operational
    MTU: 1500
    Maximum ARE Hop Count: 7
    Maximum STE Hop Count: 7
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1004
    Name: fddinet-default
    Media Type: FDDI Net
    VLAN 802.10 Id: 101004
    State: Operational
    MTU: 1500
    STP Type: IEEE
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1005
    Name: trnet-default
    Media Type: Token Ring Net
    VLAN 802.10 Id: 101005
    State: Operational
    MTU: 1500
    STP Type: IBM
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

Switch(vlan)#
		
		</pre>
	</div>
	<div class="section" title="7.2. 两层Switch配置讲解"><div class="titlepage"><div><div><h3 class="title"><a id="idp361040"></a>7.2. 两层Switch配置讲解</h3></div></div></div>
		
		<p>路由器配制</p>
		<pre class="screen">
		
Router#configure terminal

Router(config)#interface f0/0

Router(config-if)#no shutdown

Router(config-if)#interface f0/0.1 --------------- 创建子接口1

Router(config-subif)#encapsulation dot1q 2  ------ 2为VLAN号 对应VLAN 2

Router(config-subif)#ip address 10.10.11.1 255.255.255.0

Router(config-if)#interface f0/0.2 ---------------- 创建子接口2

Router(config-subif)#encapsulation dot1q 3  ------- 3为VLAN号 对应VLAN 3

Router(config-subif)#ip address 10.10.10.1 255.255.255.0

路由器已经配制完毕，可以在Router#show run 看一下当前的配制，用Router#show interfaces 看当前端口的状态，f0/0.1 和f0/0.2两个子

接口是否为up状态。
		
		</pre>
		<p>交换机配制</p>
		<pre class="screen">
		
Switch#vlan database

Switch(vlan)#vlan 2  name 财务部 ------- 创建vlan 2为财务部

Switch(vlan)#vlan 3 name  市场部----------创建vlan 3为市场部

Switch(vlan)#exit

Switch configure terminal

Switch(coning)#interface  range f0/2 - 9

Switch(coning-if)#switch port access vlan 2 ------- 将f0/-f0/9端口分到vlan 2中

Switch(config-if)#interface range f0/10 - 14

Switch(config-if)#switchport access vlan 3 --------将端f0/10至f0/14口3分到vlan 3中

Switch(config-if)#interface f0/1

Switch(config-if)#switchport trunk encapsulation dot1q ------将端口封装

Switch(config-if)#switchport mode trunk  -------- 将端口配制为trunk模式
		
		</pre>
		<p>客户端配制：</p>
		<pre class="screen">
		
WorKstation 1 配制为：10.10.11.3 255.255.255.0 网关：10.10.11.1
Workstation 2 配制为：10.10.10.3 255.255.255.0 网关：10.10.10.1
		
		</pre>
	</div>
	<div class="section" title="7.3. 3 Layer Switch"><div class="titlepage"><div><div><h3 class="title"><a id="idp366144"></a>7.3. 3 Layer Switch</h3></div></div></div>
		
		<p>3560交换机VLAN间路由的具体设置</p>
		<p>路由, VLAN, 交换机, 设置
在3560交换机上划三个VLAN，并且要求其中两个VLAN间能够互相访问，操作如下，请指点：</p>
		<div class="procedure" title="过程 5.1. Switch VLan 配置步骤"><a id="idp368048"></a><p class="title"><b>过程 5.1. Switch VLan 配置步骤</b></p><ol class="procedure" type="1"><li class="step" title="步骤 1">
				<p>激活vlan路由 </p>
				<pre class="screen">
Switch1#config t
Switch1(config)#ip routing
				</pre>
			</li><li class="step" title="步骤 2">
				<p>创建三个VLAN</p>
				<pre class="screen">
Switch1#

Switch1#vlan database

Switch1(vlan)#vlan 2

Switch1(vlan)#vlan 3

Switch1(vlan)#vlan 10

Switch1(vlan)#exit
				</pre>
			</li><li class="step" title="步骤 3">
				<p>给VLAN分配IP</p>
				<pre class="screen">
Switch1#config t

Switch1(config)#config vlan2

Switch1(config-if)#ip address 192.168.2.1 255.255.255.0

Switch1(config-if)#no shutdown


Switch1#config t

Switch1(config)#config vlan3

Switch1(config-if)#ip address 192.168.3.1 255.255.255.0

Switch1(config-if)#no shutdown
				</pre>
			</li><li class="step" title="步骤 4">
				<p>配VTP</p>
				<pre class="screen">
Switch1#

Switch1#config t

Switch1(config)#vtp domain SMG

Switch1(config)#vtp mode server

Switch1(config)#end
				</pre>
			</li><li class="step" title="步骤 5">
				<p>交换机通往路由器的接口配IP</p>
				<pre class="screen">
				
Switch1#

Switch1#config t

Switch1(config)#interface fastethernet0/1

Switch1(config-if)#no switchport

Switch1(config-if)#ip address 200.1.1.1 255.255.255.0

Switch1(config-if)#no shutdown
				
				</pre>
			</li><li class="step" title="步骤 6">
				<p>交换机配置缺省路由</p>
				<pre class="screen">
				
Switch1#

Switch1#config t

Switch(config)#ip route 0.0.0.0 0.0.0.0 200.1.1.2
				
				</pre>
			</li><li class="step" title="步骤 7">
				<p>把VLAN号分配给IP接口 </p>
				<pre class="screen">
				
Switch1#

Switch1#config t

Switch1(config)#interface fastethernet0/2

Switch1(config-if)#switchport mode access

Switch1(config-if)#switchport access vlan2

Switch1(config-if)#spanning-tree portfast

… …

Switch1#

Switch1#config t

Switch1(config)#interface fastethernet0/13

Switch1(config-if)#switchport mode access

Switch1(config-if)#switchport access vlan3

Switch1(config-if)#spanning-tree portfast
				
				</pre>
			</li><li class="step" title="步骤 8">
				<p>配访问控制列表ACL禁VLAN3子网的客户机访问服务器</p>
				<pre class="screen">
				
Switch1#

Switch1#config t

Switch1(config)#access-list 1 deny 192.168.3.0 0.0.0.255

Switch1(config)#access-list 1 permit any

Switch1(config)#interface fastethernet0/13 （此接口接服务器）

Switch1(config-if)#ip access-group 1 out
				
				</pre>
			</li><li class="step" title="步骤 9">
				<p>检查上述配置 </p>
				<pre class="screen">
				
Switch1#show vlan

Switch1#show ip route

Switch1#show interface gigabitethernet0/1 switchport

Switch1#show run

Switch1#show vtp status
				
				</pre>
			</li><li class="step" title="步骤 10">
				<p>存配置 </p>
				<pre class="screen">
				
Switch1#copy running-config startup-config
				
				</pre>
			</li></ol></div>
		</div>

	<div class="section" title="7.4. VTP"><div class="titlepage"><div><div><h3 class="title"><a id="switch.vtp"></a>7.4. VTP</h3></div></div></div>
		
		<p>VLAN Trunking Protocol（VLAN 中继协议）</p>
		<div class="section" title="7.4.1. Configuring a VTP Server"><div class="titlepage"><div><div><h4 class="title"><a id="idp386528"></a>7.4.1. Configuring a VTP Server</h4></div></div></div>
			
			<p>Server</p>
			<pre class="screen">
Switch# config terminal
Switch(config)# vtp mode server
Switch(config)# vtp domain cisco
Switch(config)# vtp password mypassword
Switch(config)# end
			</pre>
			<pre class="screen">
Switch# vlan database
Switch(vlan)# vtp server
Switch(vlan)# vtp domain cisco
Switch(vlan)# vtp password mypassword
Switch(vlan)# exit
APPLY completed.
Exiting....
Switch#
			</pre>
		</div>
		<div class="section" title="7.4.2. Configuring a VTP Client"><div class="titlepage"><div><div><h4 class="title"><a id="idp389168"></a>7.4.2. Configuring a VTP Client</h4></div></div></div>
			
			<pre class="screen">
2960#conf t
2960(config)#int f0/15
2960(config-if)#switchport mode trunk
2960(config-if)#end
2960#vlan database
2960(vlan)#vtp client
2960(vlan)#vtp domain eng_group
2960(vlan)#vtp password mypassword
2960(vlan)#exit
			</pre>
		</div>
		<div class="section" title="7.4.3. example for vtp"><div class="titlepage"><div><div><h4 class="title"><a id="idp390800"></a>7.4.3. example for vtp</h4></div></div></div>
			
			<pre class="screen">
			
cisco3750&gt;en
cisco3750#conf t
cisco3750(config)#vtp domain cisco（创建域名）
cisco3750(config)#vtp password 123（设置密码）
cisco3750(config)#vtp mode server(改成服务器模式）

cisco3750(config-if)#int g0/0（进入千兆端口）
cisco3750(config-if)#switchport trunk encapsulation dot1q(封装）
cisco3750(config-if)#switch mode trunk(改成trunk模式）

3560&gt;en
3560#conf t
3560(config)#vtp domain cisco（要以前面一致）
3560(config)#vtp password 123（要以前面一致）
3560(config)#vtp mode client（改成客户机模式）
			
			</pre>
			<pre class="screen">
3750G-1.240#show vtp stat
VTP Version                     : 2
Configuration Revision          : 4
Maximum VLANs supported locally : 1005
Number of existing VLANs        : 8
VTP Operating Mode              : Server
VTP Domain Name                 : cisco
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x5D 0x64 0xFF 0xB1 0x87 0xF7 0x5B 0x0E
Configuration last modified by 0.0.0.0 at 3-1-93 00:17:47
Local updater ID is 0.0.0.0 (no valid interface found)


3750G-1.240#show vtp password
VTP Password: 123
			</pre>
		</div>
	</div>
	</div><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="switch.channel-group.html">上一页</a> </td><td width="20%" align="center"><a accesskey="u" href="switch.html">上一级</a></td><td width="40%" align="right"> <a accesskey="n" href="switch.speed.html">下一页</a></td></tr><tr><td width="40%" align="left" valign="top">6. Ethernet Port Groups </td><td width="20%" align="center"><a accesskey="h" href="index.html">起始页</a></td><td width="40%" align="right" valign="top"> 8. 流量控制</td></tr></table></div></body></html>
